function map = map_read()
    % 读入地图
    m = 100; % 矩阵的行数
    n = 100; % 矩阵的列数
    r = 20;  % 生成圆的半径
    m1 = -m/2 : m/2-1;   % 把圆心变到矩阵的中间
    n1 = -n/2 : n/2-1;
    [x, y] = meshgrid(m1, n1);
    circle = x.^2 + y.^2;   % 计算出每一点到圆心的距离的平方

    map = zeros(m, n);  
    map(circle <= r^2) = 2;  % 找到圆内的元素，并赋值为2
    map(circle > r^2) = 0;   % 找到圆外的元素，并赋值为0
    %去除毛刺
    map(51,71) = 0;
    map(51,31) = 0;
    map(31,51) = 0;
    map(71,51) = 0;
    % 初始门
    map(52,71) = 3;
    map(51,71) = 4;
   
    %30
    %map(43,69)=4;
    %map(44,69)=4;
    %45
    %map(37,65)=4;
    %map(36,64)=4;
    %60
    %map(33,59)=4;
    %map(33,58)=4;
    %90
    %map(32,52)=4;
    %map(32,51)=4;
    %120
    %map(33,43)=4;
    %map(33,44)=4;
    %135
    %map(37,37)=4;
    %map(36,38)=4;
    %150 
    %map(43,33)=4;
    %map(44,33)=4;
    %180
    %map(51,32) = 4;
    %map(52,32) = 4;
    %-30
    %map(58,69)=4;
    %map(59,69)=4;
    %-45
    %map(65,65)=4;
    %map(66,64)=4;
    %-60
    %map(69,59)=4;
    %map(69,58)=4;
    %-90 
    %map(70,51)=4;
    %map(70,52)=4;
    %-120
    %map(69,43)=4;
    %map(69,44)=4;
    %-135
    %map(65,37)=4;
    %map(66,38)=4;
    %-150
    %map(58,33)=4;
    %map(59,33)=4;

 
    xlswrite('C:\Users\wkb\Desktop\map.xlsx',map,1);
end

